# ExportLineweightKey Class

---
A key used to represent an item stored in an ExportLineweightTable.
SystemObject Autodesk.Revit.DBExportLineweightKey
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExportLineweightKey : IDisposable

    Public Class ExportLineweightKey
    	Implements IDisposable

    public ref class ExportLineweightKey : IDisposable

    type ExportLineweightKey =
        class
            interface IDisposable
        end
The ExportLineweightKey type exposes the following members.
| Name| Description
---|---|---
| ExportLineweightKey|  Constructs a new default ExportLineweightKey.
| ExportLineweightKey(ExportLineweightKey)|  Constructs a new copy of the input ExportLineweightKey object.
| ExportLineweightKey(Int32)|  Constructs a new default ExportLineweightKey using the original line weight as input.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginalLineweight|  The original line weight.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExportLineweightKey
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace